# Parameter Type Id Rbs Elec Circuit Hot Conductor Size Param Property

Source: https://www.revitapidocs.com/2026/ba521407-49c6-9f3f-ffce-35f76bf77cc0.htm

---

| Parameter Type Id Rbs Elec Circuit Hot Conductor Size Param Property |
| --- |

"Size of Hot Conductor"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitHotConductorSizeParam { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitHotConductorSizeParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitHotConductorSizeParam {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitHotConductorSizeParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace